Dlubal.TimberPro.EffectiveLengthForBendingMembersOption
Option of effective length for bending members according to table 6.1

Dlubal.TimberPro.EffectiveLengthForBendingMembersOption.EffectiveLengthForBendingMembersOptionUnknown
Unknown

Dlubal.TimberPro.EffectiveLengthForBendingMembersOption.EffectiveLengthForBendingMembersOptionSimpleSupportedBeamConstantMoment
Simple supported beam with constant moment

Dlubal.TimberPro.EffectiveLengthForBendingMembersOption.EffectiveLengthForBendingMembersOptionSimpleSupportedBeamUniformlyDistributedLoad
Simple supported beam with uniformly distributed load

Dlubal.TimberPro.EffectiveLengthForBendingMembersOption.EffectiveLengthForBendingMembersOptionSimpleSupportedBeamConcentratedForceAtTheMiddleOfTheSpan
Simple supported beam with concentrated force at the middle of the span

Dlubal.TimberPro.EffectiveLengthForBendingMembersOption.EffectiveLengthForBendingMembersOptionCantileverUniformlyDistributedLoad
Cantilever with uniformly distributed load

Dlubal.TimberPro.EffectiveLengthForBendingMembersOption.EffectiveLengthForBendingMembersOptionCantileverConcentratedForceAtTheMiddleOfTheSpan
Cantilever with concentrated force at the middle of the span